---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotDrawStairs
source: html/d5478275-1f0e-f2bc-b3c6-914ca0fa4aae.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.CannotDrawStairs Property

Can't make stairs

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawStairs { get; }
```